[
  {
    "id": "CHG-ff8e113f",
    "change_group": "release-summary-hash-alignment",
    "plugin_version": "unreleased",
    "date": "2026-02-22",
    "summary_tags": [
      "Bug Fix",
      "Build / Packaging"
    ],
    "summary": "Use deduplicated archived entries when computing stamped summary keys so release changelog sections resolve correctly",
    "details": [
      "Updated scripts/generate_release_notes.py archive_stamped() to return the actual entries appended to archive plus duplicate-skip count.",
      "Updated stamp/archive flow to build version summary cache from deduplicated appended entries, preventing hash mismatches with build_changelog rendering.",
      "Regenerated v0.8.3 summary cache key and rebuilt CHANGELOG.md so v0.8.3 renders the structured summary instead of condensed fallback."
    ]
  },
  {
    "id": "CHG-c9577a5f",
    "change_group": "vscode-git-refresh-settings",
    "plugin_version": "unreleased",
    "date": "2026-02-22",
    "summary_tags": [
      "Configuration Cleanup",
      "UI Improvement"
    ],
    "summary": "Enable automatic Git fetch and prune in VS Code workspace settings",
    "details": [
      "Added git.autofetch=true so VS Code refreshes remote refs without manual fetches.",
      "Added git.pruneOnFetch=true so deleted remote branches are removed from local tracking refs.",
      "Helps the PR/branch UI reflect post-merge release workflow updates faster and with less stale branch noise."
    ]
  },
  {
    "id": "CHG-0f866788",
    "change_group": "post-merge-release-auto-sync",
    "plugin_version": "unreleased",
    "date": "2026-02-22",
    "summary_tags": [
      "Configuration Cleanup",
      "Build / Packaging"
    ],
    "summary": "Auto-sync local main after release-please stamp commits land",
    "details": [
      "Added .githooks/post-merge to launch a background watcher after local merges on main.",
      "Added scripts/auto_pull_after_release.py to poll origin/main, require fast-forward safety, and run git pull --ff-only when the release stamp commit appears.",
      "Configured repository hook line endings via .gitattributes and documented the watcher in scripts/README.md."
    ]
  },
  {
    "id": "CHG-c8f120c8",
    "change_group": "prefs-panel-layout-self-update",
    "plugin_version": "unreleased",
    "date": "2026-02-22",
    "summary_tags": [
      "UI Improvement",
      "New Feature"
    ],
    "summary": "Rearranged the settings panel and added a plugin self-update frame with GitHub release install support",
    "details": [
      "Reworked Settings tab layout so Plugin and Static Shift frames share the top row while VKB-Link spans full width beneath them.",
      "Flattened VKB-Link controls to a single line and moved status plus Check Version immediately to the right of Auto-manage, with Locate kept inline.",
      "Added edmcruleengine.plugin_update_manager with GitHub latest-release ZIP install flow, wired it to a new Plugin Update button, added tests, and included the module in packaging."
    ]
  },
  {
    "id": "CHG-c8f120c8-1",
    "change_group": "prefs-panel-layout-self-update",
    "plugin_version": "unreleased",
    "date": "2026-02-22",
    "summary_tags": [
      "UI Improvement"
    ],
    "summary": "Adjusted settings panel labels and right-aligned VKB status/update controls",
    "details": [
      "Renamed the Plugin frame label to VKB Connector and changed Current to Current Version for the plugin version display.",
      "Renamed the plugin action button to Update EDMC Plugin and preserved that text after update checks complete.",
      "Inserted a flexible spacer after Auto-manage so VKB status text and the VKB update action align to the right side, and renamed Check Version to Update VKB-Link."
    ]
  },
  {
    "id": "CHG-c8f120c8-2",
    "change_group": "prefs-panel-layout-self-update",
    "plugin_version": "unreleased",
    "date": "2026-02-22",
    "summary_tags": [
      "UI Improvement"
    ],
    "summary": "Aligned plugin update action to the right and switched VKB-Link update to button/popup feedback",
    "details": [
      "Right-aligned the Update EDMC Plugin button in the VKB Connector frame while keeping version text on the left.",
      "Replaced VKB-Link update progress/result status-line messaging with button state text changes (Checking... -> Update VKB-Link).",
      "Updated VKB-Link update flow to show popup success/error messages like the plugin updater and still refresh connection/app status after completion."
    ]
  },
  {
    "id": "CHG-c8f120c8-3",
    "change_group": "prefs-panel-layout-self-update",
    "plugin_version": "unreleased",
    "date": "2026-02-22",
    "summary_tags": [
      "UI Improvement"
    ],
    "summary": "Fixed update button widths to prevent resize when button text changes",
    "details": [
      "Set a fixed width for the Update EDMC Plugin button so switching to Checking... keeps the same button size.",
      "Set a fixed width for the Update VKB-Link button so transient text changes do not alter layout width.",
      "Validated prefs_panel.py compiles successfully after the sizing update."
    ]
  },
  {
    "id": "CHG-c8f120c8-4",
    "change_group": "rule-editor-save-feedback",
    "plugin_version": "unreleased",
    "date": "2026-02-22",
    "summary_tags": [
      "UI Improvement"
    ],
    "summary": "Removed the rule-save success popup after editing a rule",
    "details": [
      "Deleted the centered 'Rule saved successfully' info dialog call from the rule editor save callback.",
      "Kept rule persistence and editor-window close behavior unchanged after save.",
      "Validated src/edmcruleengine/rule_editor.py compiles after the change."
    ]
  }
]
