{
  "0.8.2:0e0a245660d2": "### Overview\n\nThis release includes 1 changelog updates across 1 grouped workstreams, focused on Bug Fix.\n\n### Bug Fixes\n- Fixed issues in release process and changelog tooling.",
  "0.8.1:66a7efea7f86": "### Overview\n\nThis release includes 19 changelog updates across 19 grouped workstreams, focused on New Feature, Bug Fix, Configuration Cleanup.\n\n### New Features\n- Added new capabilities for changelog tooling and packaging.\n\n### Bug Fixes\n- Fixed issues in changelog tooling and release process.\n\n### Improvements\n- Cleaned up configuration for changelog tooling and configuration.\n\n### Build and Packaging\n- Improved build and packaging for release process and changelog tooling.\n\n### Documentation\n- Updated documentation for release-process documentation.",
  "0.8.0:3805cf8520fc": "### Overview\n\nThis release includes 16 changelog updates across 10 grouped workstreams, focused on Bug Fix, Code Refactoring, Configuration Cleanup.\n\n### Bug Fixes\n- Fixed issues in release process.\n\n### Improvements\n- Refactored changelog tooling and vkb-link lifecycle for maintainability.\n\n### Improvements\n- Cleaned up configuration for vkb-link lifecycle and ui and preferences.\n\n### Documentation\n- Updated documentation for release-process documentation.",
  "0.7.0:2a6ee4812eab": "### Overview\n\nThis release includes 1 changelog updates across 1 grouped workstreams, focused on Documentation Update.\n\n### Documentation\n- Updated documentation for release-process documentation.",
  "0.5.1:47bc1f31fe16": "### Overview\n\nThis release includes 85 changelog updates across 85 grouped workstreams, focused on New Feature, Bug Fix, UI Improvement.\n\n### New Features\n- Added new capabilities for vkb-link lifecycle and rule engine.\n\n### Bug Fixes\n- Fixed issues in vkb-link lifecycle and ui and preferences.\n\n### UI Improvements\n- Improved UI workflows for vkb-link lifecycle and ui and preferences.\n\n### Performance Improvements\n- Improved performance for multiple areas.\n\n### Improvements\n- Refactored vkb-link lifecycle and process reliability for maintainability.\n\n### Improvements\n- Cleaned up configuration for configuration and vkb-link lifecycle.\n\n### Testing\n- Expanded test coverage for vkb-link lifecycle and tests.\n\n### Documentation\n- Updated documentation for developer and release-process documentation.",
  "0.5.0:8af3ae5ef7d1": "### Overview\n\nThis release includes 1 changelog updates across 1 grouped workstreams, focused on Bug Fix.\n\n### Bug Fixes\n- Fixed issues in packaging.",
  "0.4.0:bf825502606e": "### Overview\n\nThis release includes 7 changelog updates across 7 grouped workstreams, focused on Configuration Cleanup, Build / Packaging, Documentation Update.\n\n### Improvements\n- Cleaned up configuration for multiple areas.\n\n### Build and Packaging\n- Improved build and packaging for changelog tooling and release process.\n\n### Documentation\n- Updated documentation for release-process documentation.",
  "0.8.3:4036082e492e": "### Overview\n\nThis release includes 4 changelog updates across 4 grouped workstreams, focused on Bug Fix, Build / Packaging.\n\n### Bug Fixes\n- Fixed issues in release process and changelog tooling.\n\n### Build and Packaging\n- Improved build and packaging for release process.",
  "0.8.4:f4e5b57d3f0a": "### Overview\n\nThis release includes 1 changelog updates across 1 grouped workstreams, focused on Bug Fix.\n\n### Bug Fixes\n- Fixed issues in release process and changelog tooling.",
  "0.8.5:f3dda03235e6": "### Overview\n\nThis release includes 2 changelog updates across 2 grouped workstreams, focused on Configuration Cleanup.\n\n### Improvements\n- Cleaned up configuration for configuration and release process.",
  "0.9.0:4e1b4c88326e": "### Overview\n\nThis release includes 6 changelog updates across 3 grouped workstreams, focused on UI Improvement, Configuration Cleanup.\n\n### UI Improvements\n- Improved UI workflows for ui and preferences and rule engine.\n\n### Improvements\n- Cleaned up configuration for changelog tooling.",
  "0.9.1:970f79d727fa": "### Overview\n\nThis release includes 17 changelog updates across 4 grouped workstreams, focused on Bug Fix.\n\n### Bug Fixes\n- Fixed issues in vkb-link lifecycle and release process.",
  "0.9.2:0457b5bd0be4": "### Overview\n\nThis release includes 2 changelog updates across 2 grouped workstreams, focused on Bug Fix.\n\n### Bug Fixes\n- Fixed issues in changelog tooling and rule engine.",
  "0.10.1:0de12b49af6c": "### Overview\n\nThis release includes 21 changelog updates across 5 grouped workstreams, focused on New Feature, Bug Fix, Code Refactoring.\n\n### New Features\n- Added new capabilities for changelog tooling.\n\n### Bug Fixes\n- Fixed issues in release process.\n\n### Improvements\n- Refactored changelog tooling and vkb-link lifecycle for maintainability.",
  "unreleased:7d02d119e532": "### Overview\n\nThis release enhances changelog summarization with a new local AI option and improves consistency, reliability, and efficiency across all AI-powered outputs.\n\n### New Features\n- Added support for LMStudio as a local LLM backend, allowing users to generate changelog summaries without relying on external services.\n- Integrated LMStudio into the fallback orchestration and VS Code tasks for seamless use alongside other AI providers.\n\n### Improvements\n- Standardized formatting of AI-generated summaries—ensuring consistent bullet styles (e.g., `-` instead of `•`), spacing, and section structure across all backends.\n- Centralized core changelog analysis logic to improve maintainability and ensure statistical overviews remain consistent—even when AI responses are incomplete.\n- Optimized prompts by removing unnecessary details and simplifying instructions, reducing token usage while preserving output quality.\n\n### Bug Fixes\n- Resolved a `NameError` in release notes generation by importing missing utility functions and completing the logic consolidation."
}
