{
  "0.8.2:0e0a245660d2": "### Overview\n\nThis release includes 1 changelog updates across 1 grouped workstreams, focused on Bug Fix.\n\n### Bug Fixes\n- Fixed issues in release process and changelog tooling.",
  "0.8.1:66a7efea7f86": "### Overview\n\nThis release includes 19 changelog updates across 19 grouped workstreams, focused on New Feature, Bug Fix, Configuration Cleanup.\n\n### New Features\n- Added new capabilities for changelog tooling and packaging.\n\n### Bug Fixes\n- Fixed issues in changelog tooling and release process.\n\n### Improvements\n- Cleaned up configuration for changelog tooling and configuration.\n\n### Build and Packaging\n- Improved build and packaging for release process and changelog tooling.\n\n### Documentation\n- Updated documentation for release-process documentation.",
  "0.8.0:3805cf8520fc": "### Overview\n\nThis release includes 16 changelog updates across 10 grouped workstreams, focused on Bug Fix, Code Refactoring, Configuration Cleanup.\n\n### Bug Fixes\n- Fixed issues in release process.\n\n### Improvements\n- Refactored changelog tooling and vkb-link lifecycle for maintainability.\n\n### Improvements\n- Cleaned up configuration for vkb-link lifecycle and ui and preferences.\n\n### Documentation\n- Updated documentation for release-process documentation.",
  "0.7.0:2a6ee4812eab": "### Overview\n\nThis release includes 1 changelog updates across 1 grouped workstreams, focused on Documentation Update.\n\n### Documentation\n- Updated documentation for release-process documentation.",
  "0.5.1:47bc1f31fe16": "### Overview\n\nThis release includes 85 changelog updates across 85 grouped workstreams, focused on New Feature, Bug Fix, UI Improvement.\n\n### New Features\n- Added new capabilities for vkb-link lifecycle and rule engine.\n\n### Bug Fixes\n- Fixed issues in vkb-link lifecycle and ui and preferences.\n\n### UI Improvements\n- Improved UI workflows for vkb-link lifecycle and ui and preferences.\n\n### Performance Improvements\n- Improved performance for multiple areas.\n\n### Improvements\n- Refactored vkb-link lifecycle and process reliability for maintainability.\n\n### Improvements\n- Cleaned up configuration for configuration and vkb-link lifecycle.\n\n### Testing\n- Expanded test coverage for vkb-link lifecycle and tests.\n\n### Documentation\n- Updated documentation for developer and release-process documentation.",
  "0.5.0:8af3ae5ef7d1": "### Overview\n\nThis release includes 1 changelog updates across 1 grouped workstreams, focused on Bug Fix.\n\n### Bug Fixes\n- Fixed issues in packaging.",
  "0.4.0:bf825502606e": "### Overview\n\nThis release includes 7 changelog updates across 7 grouped workstreams, focused on Configuration Cleanup, Build / Packaging, Documentation Update.\n\n### Improvements\n- Cleaned up configuration for multiple areas.\n\n### Build and Packaging\n- Improved build and packaging for changelog tooling and release process.\n\n### Documentation\n- Updated documentation for release-process documentation.",
  "0.8.3:4036082e492e": "### Overview\n\nThis release includes 4 changelog updates across 4 grouped workstreams, focused on Bug Fix, Build / Packaging.\n\n### Bug Fixes\n- Fixed issues in release process and changelog tooling.\n\n### Build and Packaging\n- Improved build and packaging for release process.",
  "0.8.4:f4e5b57d3f0a": "### Overview\n\nThis release includes 1 changelog updates across 1 grouped workstreams, focused on Bug Fix.\n\n### Bug Fixes\n- Fixed issues in release process and changelog tooling.",
  "0.8.5:f3dda03235e6": "### Overview\n\nThis release includes 2 changelog updates across 2 grouped workstreams, focused on Configuration Cleanup.\n\n### Improvements\n- Cleaned up configuration for configuration and release process.",
  "0.9.0:4e1b4c88326e": "### Overview\n\nThis release includes 6 changelog updates across 3 grouped workstreams, focused on UI Improvement, Configuration Cleanup.\n\n### UI Improvements\n- Improved UI workflows for ui and preferences and rule engine.\n\n### Improvements\n- Cleaned up configuration for changelog tooling.",
  "unreleased:970f79d727fa": "This release focuses on more reliable VKB‑Link detection and connection with a clearer, quieter UI. It also reduces startup pop‑ups and tightens packaging and release‑note consistency.\n\n### Improvements\n- Uses native Windows process detection with a quieter log and no flashing console windows during background checks.\n- Preferences clearly reflect what’s available: controls disable/hide when management isn’t available, with guidance when VKB‑Link must be downloaded and run manually.\n- Continuously watches for VKB‑Link starting or stopping (even if launched manually) and runs the normal reconnect flow automatically.\n- Connection status reflects a live network link; if VKB‑Link stops, the status updates immediately.\n- Managed downloads and updates work even without extra encryption components by using a built‑in fallback.\n- Release notes use a consistent format across versions, and changelog/release notes remain source‑neutral (author attribution removed).\n\n### Bug Fixes\n- Startup now respects the Auto‑manage setting; VKB‑Link is not launched when auto‑manage is turned off.\n- Avoids false restarts and connection failures by preferring the correct configuration file name.\n- Waits briefly after detecting a manually started VKB‑Link before connecting, reducing flakiness.\n- Corrects fallback behavior when discovering the configuration file location.\n- Prevents unexpected command windows from appearing during EDMC startup.\n- Interprets on/off values safely so strings like “false” don’t accidentally enable features.\n\n### Packaging\n- Includes all required modules so startup and auto‑manage fixes ship with the plugin.\n- Bundles the built‑in encryption fallback so managed operations work without extra installs.\n- Disables automatic installation of encryption components by default and only attempts it when appropriate to avoid pop‑ups.\n- Normalizes stamped release summaries so release notes stay uniform."
}
