[
  {
    "id": "CHG-68845a1a",
    "change_group": "release-summary-normalization",
    "plugin_version": "unreleased",
    "date": "2026-02-22",
    "summary_tags": [
      "Bug Fix",
      "Build / Packaging"
    ],
    "summary": "Normalize stamped release summary cache format instead of promoting unreleased narrative text",
    "details": [
      "Updated scripts/generate_release_notes.py ensure_version_summary_cache() to prefer deterministic release-format summary generation for stamped versions.",
      "Kept unreleased-summary promotion only as a fallback when deterministic generation cannot produce output.",
      "Regenerated the 0.9.0 summary with the intelligent backend so CHANGELOG.summaries.json now uses the same ### Overview structure as other releases."
    ]
  },
  {
    "id": "CHG-68845a1a-1",
    "change_group": "vkb-link-startup-hardening",
    "plugin_version": "unreleased",
    "date": "2026-02-22",
    "summary_tags": [
      "Bug Fix",
      "Configuration Cleanup"
    ],
    "summary": "Suppress VKB lifecycle subprocess popups and add command-level diagnostics for startup failures",
    "details": [
      "Added hidden Windows subprocess wrappers in vkb_link_manager so tasklist/wmic/powershell/taskkill calls no longer flash console windows.",
      "Disabled runtime pip auto-install attempts for cryptography to avoid surprise command windows during EDMC startup.",
      "Added debug logging for subprocess command execution and return codes, and fixed VKB INI filename discovery fallback regression."
    ]
  },
  {
    "id": "CHG-68845a1a-2",
    "change_group": "vkb-link-startup-hardening",
    "plugin_version": "unreleased",
    "date": "2026-02-22",
    "summary_tags": [
      "Bug Fix",
      "Test Update"
    ],
    "summary": "Align VKB-Link INI target with production filename to prevent false restarts and connection failures",
    "details": [
      "Re-prioritized VKB-Link INI discovery to prefer VKB-Link.ini while still accepting VKBLink.ini compatibility.",
      "Updated manager default-path tests to assert against the configured primary INI filename constant rather than a hardcoded variant.",
      "Verified vkb_link_manager behavior with full focused test pass (36/36)."
    ]
  },
  {
    "id": "CHG-68845a1a-3",
    "change_group": "vkb-link-startup-hardening",
    "plugin_version": "unreleased",
    "date": "2026-02-22",
    "summary_tags": [
      "Code Refactoring",
      "Bug Fix"
    ],
    "summary": "Replace Windows PowerShell/WMIC process detection with tasklist-only parsing",
    "details": [
      "Simplified VKB-Link process discovery on Windows to parse tasklist CSV output and return PID-based results without PowerShell or WMIC calls.",
      "Kept lifecycle stop/start logic unchanged while preserving hidden subprocess execution and command diagnostics.",
      "Updated Windows-specific manager tests for tasklist parsing and verified focused suite passes (36/36)."
    ]
  },
  {
    "id": "CHG-68845a1a-4",
    "change_group": "vkb-link-startup-hardening",
    "plugin_version": "unreleased",
    "date": "2026-02-22",
    "summary_tags": [
      "Code Refactoring",
      "UI Improvement"
    ],
    "summary": "Use native Windows process enumeration with cleaner lifecycle logging",
    "details": [
      "Added native WinAPI process snapshot enumeration for VKB-Link detection and made tasklist a fallback-only path.",
      "Reduced subprocess debug noise by default so recurring health checks no longer emit repetitive raw command lines.",
      "Added one-time fallback notice when native enumeration is unavailable and kept command diagnostics for failure scenarios."
    ]
  },
  {
    "id": "CHG-68845a1a-5",
    "change_group": "vkb-link-managed-dependency-gating",
    "plugin_version": "unreleased",
    "date": "2026-02-22",
    "summary_tags": [
      "Bug Fix",
      "UI Improvement",
      "Configuration Cleanup"
    ],
    "summary": "Gate managed VKB-Link controls on cryptography availability with background install fallback and manual-mode UI",
    "details": [
      "Added one-time background cryptography auto-install attempt (default enabled) and exposed managed availability/reason through VKB-Link status.",
      "Automatically disables vkb_link_auto_manage when cryptography remains unavailable and returns a manual-run status message for managed actions.",
      "Updated preferences UI to disable Auto-manage, hide Update VKB-Link, and show 'VKB needs to be downloaded and run manually' when managed mode is unavailable."
    ]
  },
  {
    "id": "CHG-68845a1a-6",
    "change_group": "vkb-link-managed-dependency-gating",
    "plugin_version": "unreleased",
    "date": "2026-02-22",
    "summary_tags": [
      "Bug Fix",
      "UI Improvement"
    ],
    "summary": "Allow manual located VKB-Link management when cryptography download support is unavailable",
    "details": [
      "Adjusted VKBLinkManager gating so missing cryptography blocks only managed download/update paths; known executable lifecycle management remains available.",
      "Updated VKB-Link preferences UI to keep Locate available, hide only Update VKB-Link when managed download support is unavailable, and show manual-mode status only when no executable path is known.",
      "Updated status label layout to avoid fixed-width cropping and added tests covering known-exe startup when cryptography is unavailable."
    ]
  },
  {
    "id": "CHG-68845a1a-7",
    "change_group": "vkb-link-managed-dependency-gating",
    "plugin_version": "unreleased",
    "date": "2026-02-22",
    "summary_tags": [
      "Bug Fix",
      "UI Improvement"
    ],
    "summary": "Enable manual-process detection and reconnect workflow even when VKB-Link path is unknown",
    "details": [
      "Updated preferences polling safety worker to detect any running VKB-Link process (including manually started instances without a stored exe path) and invoke the standard EventHandler connect workflow.",
      "Prevented manual-mode warning text from overriding active connected/reconnecting status indicators.",
      "Retained existing auto-start behavior for known executable paths while preserving non-blocking UI polling design."
    ]
  },
  {
    "id": "CHG-68845a1a-8",
    "change_group": "vkb-link-managed-dependency-gating",
    "plugin_version": "unreleased",
    "date": "2026-02-22",
    "summary_tags": [
      "Bug Fix",
      "UI Improvement"
    ],
    "summary": "Drive VKB status display from process state for manual and managed modes",
    "details": [
      "Added always-on background VKB-Link process probe in preferences polling so process stop/start is detected regardless of auto-manage mode.",
      "Updated connection status rendering to prioritize process-running state: a stopped process now forces disconnected status even if socket flags are stale.",
      "Kept manual process detection and standard connect workflow in the same probe while retaining auto-start behavior only when auto-manage is enabled and an executable path is known."
    ]
  },
  {
    "id": "CHG-68845a1a-9",
    "change_group": "vkb-link-managed-dependency-gating",
    "plugin_version": "unreleased",
    "date": "2026-02-22",
    "summary_tags": [
      "Bug Fix"
    ],
    "summary": "Respect auto-manage disabled setting during plugin startup VKB-Link checks",
    "details": [
      "Updated load.py startup VKB-Link worker to read vkb_link_auto_manage and skip ensure_running when auto-manage is disabled.",
      "Expanded startup status logging to include auto_manage state for easier diagnosis of unintended launches.",
      "Validated with focused tests covering load/event-handler/vkb-manager/config suites."
    ]
  },
  {
    "id": "CHG-68845a1a-10",
    "change_group": "vkb-link-managed-dependency-gating",
    "plugin_version": "unreleased",
    "date": "2026-02-22",
    "summary_tags": [
      "Bug Fix",
      "UI Improvement"
    ],
    "summary": "Make VKB connection status require live TCP state and force disconnect when process stops",
    "details": [
      "Updated prefs polling to treat established state as connected plus live socket, not process detection alone.",
      "When process probe reports VKB-Link stopped, preferences now force a socket disconnect so stale connected flags are cleared immediately.",
      "Kept process-driven reconnect workflow unchanged so connection retries only run after process is detected again."
    ]
  },
  {
    "id": "CHG-68845a1a-11",
    "change_group": "vkb-link-managed-dependency-gating",
    "plugin_version": "unreleased",
    "date": "2026-02-22",
    "summary_tags": [
      "Bug Fix",
      "Test Update"
    ],
    "summary": "Apply uniform process-settle connection workflow for manual VKB runs and harden auto-manage bool parsing",
    "details": [
      "VKBLinkManager now tracks process running transitions and applies warmup settle delay after external/manual process detection before TCP connect attempts.",
      "Updated startup, event-handler, manager, and preferences auto-manage boolean reads to use strict value coercion so string values like 'false' do not accidentally enable managed startup behavior.",
      "Added regression tests covering startup skip when auto-manage is stored as string false and settle-delay behavior after external process detection."
    ]
  },
  {
    "id": "CHG-68845a1a-12",
    "change_group": "vkb-link-managed-dependency-gating",
    "plugin_version": "unreleased",
    "date": "2026-02-22",
    "summary_tags": [
      "Build / Packaging",
      "Bug Fix"
    ],
    "summary": "Include bool_utils in plugin package so startup auto-manage fixes deploy correctly",
    "details": [
      "Added src/edmcruleengine/bool_utils.py to scripts/package_plugin.py include list.",
      "Verified packaging output now contains EDMCVKBConnector/edmcruleengine/bool_utils.py.",
      "Prevents runtime drift where installed plugin misses new boolean parsing and startup gating behavior."
    ]
  },
  {
    "id": "CHG-68845a1a-13",
    "change_group": "vkb-link-managed-dependency-gating",
    "plugin_version": "unreleased",
    "date": "2026-02-22",
    "summary_tags": [
      "Bug Fix",
      "Configuration Cleanup"
    ],
    "summary": "Disable default cryptography auto-install in EDMC runtime and limit pip fallback to real Python interpreters",
    "details": [
      "Changed vkb_link_auto_install_cryptography default to false in config defaults and fallback constants so EDMC no longer attempts pip by default.",
      "Added runtime interpreter resolution for cryptography pip fallback and skip installation when running under non-Python launchers like EDMarketConnector.exe.",
      "Added manager tests covering install command resolution and default auto-install policy."
    ]
  },
  {
    "id": "CHG-68845a1a-14",
    "change_group": "vkb-link-managed-dependency-gating",
    "plugin_version": "unreleased",
    "date": "2026-02-22",
    "change_source": "agent",
    "summary_tags": [
      "Bug Fix",
      "Build / Packaging",
      "Test Update"
    ],
    "summary": "Add seamless bundled AES fallback so MEGA-managed VKB operations work without cryptography",
    "details": [
      "Updated vkb_link_manager MEGA AES decrypt paths to use cryptography when available and bundled pure_python_aes fallback otherwise.",
      "Changed managed-availability gating and error messaging to fail only when no AES backend is available, avoiding false manual-mode warnings.",
      "Added fallback regression tests and included pure_python_aes.py in plugin packaging output."
    ]
  },
  {
    "id": "CHG-68845a1a-15",
    "change_group": "changelog-source-attribution",
    "plugin_version": "unreleased",
    "date": "2026-02-22",
    "change_source": "agent",
    "summary_tags": [
      "New Feature",
      "Build / Packaging"
    ],
    "summary": "Track manual versus agent-authored changelog entries and surface source mix in release outputs",
    "details": [
      "Updated scripts/log_change.py to accept --agent human and persist change_source metadata (manual vs agent) on new changelog entries.",
      "Updated scripts/generate_release_notes.py to infer source for legacy entries and append a Change Source table to release notes, including LLM and intelligent rendering paths.",
      "Updated scripts/build_changelog.py to show source split lines in unreleased previews and released version sections so release-change logs visibly separate manual and agent-assisted work."
    ]
  },
  {
    "id": "CHG-68845a1a-16",
    "change_group": "changelog-source-attribution",
    "plugin_version": "unreleased",
    "date": "2026-02-22",
    "summary_tags": [
      "Bug Fix",
      "Configuration Cleanup"
    ],
    "summary": "Remove change-source attribution from changelog and release-note rendering",
    "details": [
      "Reverted scripts/log_change.py to stop writing change_source metadata and removed the temporary human agent mode.",
      "Removed source-breakdown sections from scripts/generate_release_notes.py so outputs no longer show manual vs agent counts.",
      "Removed source-split lines from scripts/build_changelog.py so changelog previews and released sections stay source-neutral."
    ]
  }
]
