{
  "0.5.0:8af3ae5ef7d1": "### Overview\n\nThis release includes 1 changelog updates across 1 grouped workstreams, focused on Bug Fix.\n\n### Bug Fixes\n- Fixed issues in packaging.",
  "0.7.0:2a6ee4812eab": "### Overview\n\nThis release includes 1 changelog updates across 1 grouped workstreams, focused on Documentation Update.\n\n### Documentation\n- Updated documentation for release-process documentation.",
  "0.8.0:3805cf8520fc": "### Overview\n\nThis release includes 16 changelog updates across 10 grouped workstreams, focused on Bug Fix, Code Refactoring, Configuration Cleanup.\n\n### Bug Fixes\n- Fixed issues in release process.\n\n### Improvements\n- Refactored changelog tooling and vkb-link lifecycle for maintainability.\n\n### Improvements\n- Cleaned up configuration for vkb-link lifecycle and ui and preferences.\n\n### Documentation\n- Updated documentation for release-process documentation.",
  "0.5.1:47bc1f31fe16": "### Overview\n\nThis release includes 85 changelog updates across 85 grouped workstreams, focused on New Feature, Bug Fix, UI Improvement.\n\n### New Features\n- Added new capabilities for vkb-link lifecycle and rule engine.\n\n### Bug Fixes\n- Fixed issues in vkb-link lifecycle and ui and preferences.\n\n### UI Improvements\n- Improved UI workflows for vkb-link lifecycle and ui and preferences.\n\n### Performance Improvements\n- Improved performance for multiple areas.\n\n### Improvements\n- Refactored vkb-link lifecycle and process reliability for maintainability.\n\n### Improvements\n- Cleaned up configuration for configuration and vkb-link lifecycle.\n\n### Testing\n- Expanded test coverage for vkb-link lifecycle and tests.\n\n### Documentation\n- Updated documentation for developer and release-process documentation.",
  "0.4.0:bf825502606e": "### Overview\n\nThis release includes 7 changelog updates across 7 grouped workstreams, focused on Configuration Cleanup, Build / Packaging, Documentation Update.\n\n### Improvements\n- Cleaned up configuration for multiple areas.\n\n### Build and Packaging\n- Improved build and packaging for changelog tooling and release process.\n\n### Documentation\n- Updated documentation for release-process documentation.",
  "unreleased:e84943ee101d": "Here's a summary of all **13 unreleased changelog entries**:\n\n---\n\n## Unreleased Changes — Summary\n\n### Changelog Infrastructure Fixes (4 entries)\n| ID | Summary |\n|---|---|\n| CHG-52face3a | Release rollover now preserves version summaries and reliably resets unreleased state |\n| CHG-52face3a-1 | Backfilled missing v0.7.0 and v0.8.0 history; aligned unreleased entries with post-release state |\n| CHG-52face3a-2 | Normalized archive summary cache keys to hash-based format; removed legacy prefix fallback |\n| CHG-52face3a-3 | Rebuilt all version summaries using deterministic grouped summarization backend |\n\n### Release Workflow Improvements (3 entries)\n| ID | Summary |\n|---|---|\n| CHG-471f2512 | Added `--skip-prepare` dispatch-only mode to avoid redundant pre-release runs |\n| CHG-471f2512-1 | Streamlined VS Code task picker with favorites, `[fav]` labels, and input-driven release prompts |\n| CHG-471f2512-2 | Fixed release preview to label output as \"Unreleased\" instead of current version number |\n\n### LLM Backend & Config Refactoring (6 entries)\n| ID | Summary |\n|---|---|\n| CHG-471f2512-3 | Moved changelog/release LLM runtime defaults to config; removed hardcoded model assumptions |\n| CHG-471f2512-4 | Switched LLM flows to CLI-only backends (`claude-cli`/`codex`); removed Anthropic API fallback |\n| CHG-471f2512-5 | Split delegation config from changelog config; added prompt/runtime controls to changelog config |\n| CHG-471f2512-6 | Refactored changelog config into per-backend sections (`codex`, `claude_cli`, `intelligent`) |\n| CHG-471f2512-7 | Simplified to a single shared `timeout_seconds` setting; removed per-backend timeout fields |\n| CHG-471f2512-8 | Moved `delegation-config.json` to `scripts/`; untracked generated `CHANGELOG.md` and summaries |\n\n---\n\n**Tags represented:** `Bug Fix` · `Code Refactoring` · `Build / Packaging` · `Documentation Update` · `Configuration Cleanup` · `UI Improvement`\n\n**Date range:** All entries dated 2026-02-22",
  "unreleased:f7e86a4101d0": "This update focuses on making changelog and release notes generation more reliable and consistent while simplifying configuration and streamlining developer workflows. It also adds a preview changelog to review upcoming changes before a release.\n\n### New Features\n- Add a changelog preview file with an Unreleased section for quick pre‑release review.\n\n### Bug Fixes\n- Release rollovers now keep the correct summaries and reset the Unreleased state properly.\n- Preview release notes are clearly labeled “Unreleased” when not stamping a version.\n- The published changelog shows only released versions; Unreleased work no longer appears in the markdown.\n- Every stamped release now gets a summary even if no prior preview was generated, preventing empty or partial sections.\n- Archived versions consistently display full summaries instead of shortened fallbacks.\n\n### Improvements\n- Clearer, smarter release summaries that group similar changes and avoid repetition.\n- Faster releases with a dispatch‑only path when a preview is already prepared.\n- Cleaner editor task picker with favorites and fewer redundant entries.\n- More dependable local tooling by standardizing on command‑line tools and increasing timeouts for long runs.\n- Simplified configuration: tool settings are centralized, organized by tool where helpful, and use a single shared timeout.\n- Less repository noise by ignoring generated changelog artifacts and tracking only the source files.\n- Packaging updates ensure summary data is included so summaries carry over correctly during releases.\n\n### Documentation\n- Restored missing v0.7.0 and v0.8.0 history and aligned the Unreleased list with current post‑release work.\n- Expanded configuration guidance with examples for choosing tools and timeouts.\n- Regenerated the changelog so released history renders consistently.",
  "unreleased:66a7efea7f86": "## Unreleased\n\nThis update focuses on making changelog and release‑note generation more reliable and predictable. It fixes rollover and stamping issues, streamlines configuration and workflows, and adds a preview to review upcoming changes.\n\n### New Features\n- Changelog preview file to review pending changes before a release.\n\n### Bug Fixes\n- Preserve version summaries during release rollover and reset the unreleased state correctly.\n- Always stamp releases with a matching summary, promoting the unreleased text when available or generating one when missing.\n- Match summaries to the correct version to avoid incorrect or duplicated text.\n- Archived releases now render complete summaries consistently (no legacy fallbacks).\n- Default previews are labeled “Unreleased” instead of a version number.\n- Published changelog shows released history only, keeping unreleased items out of the markdown.\n\n### Improvements\n- Cleaner, grouped release summaries that avoid repeated entries.\n- Simpler, config‑driven settings for how summaries and release notes are generated.\n- More predictable builds by standardizing how version summaries are stored and cleaned up.\n- Faster release workflow with an option to dispatch a release when a preview already exists.\n- Automation now includes the data needed for accurate summaries while ignoring generated files.\n- Streamlined VS Code task picker with favorites and parameterized workflows; terminal uses the workspace Python by default.\n- More reliable local tooling for generating release text, with longer timeouts for large inputs.\n\n### Documentation\n- Backfilled the missing v0.7.0 and v0.8.0 history and aligned the unreleased section with the post‑release state.\n- Documented configuration options and the new preview workflow; rebuilt the markdown changelog to reflect the latest history."
}
