{
  "0.8.2:0e0a245660d2": "### Overview\n\nThis release includes 1 changelog updates across 1 grouped workstreams, focused on Bug Fix.\n\n### Bug Fixes\n- Fixed issues in release process and changelog tooling.",
  "0.8.1:66a7efea7f86": "### Overview\n\nThis release includes 19 changelog updates across 19 grouped workstreams, focused on New Feature, Bug Fix, Configuration Cleanup.\n\n### New Features\n- Added new capabilities for changelog tooling and packaging.\n\n### Bug Fixes\n- Fixed issues in changelog tooling and release process.\n\n### Improvements\n- Cleaned up configuration for changelog tooling and configuration.\n\n### Build and Packaging\n- Improved build and packaging for release process and changelog tooling.\n\n### Documentation\n- Updated documentation for release-process documentation.",
  "0.8.0:3805cf8520fc": "### Overview\n\nThis release includes 16 changelog updates across 10 grouped workstreams, focused on Bug Fix, Code Refactoring, Configuration Cleanup.\n\n### Bug Fixes\n- Fixed issues in release process.\n\n### Improvements\n- Refactored changelog tooling and vkb-link lifecycle for maintainability.\n\n### Improvements\n- Cleaned up configuration for vkb-link lifecycle and ui and preferences.\n\n### Documentation\n- Updated documentation for release-process documentation.",
  "0.7.0:2a6ee4812eab": "### Overview\n\nThis release includes 1 changelog updates across 1 grouped workstreams, focused on Documentation Update.\n\n### Documentation\n- Updated documentation for release-process documentation.",
  "0.5.1:47bc1f31fe16": "### Overview\n\nThis release includes 85 changelog updates across 85 grouped workstreams, focused on New Feature, Bug Fix, UI Improvement.\n\n### New Features\n- Added new capabilities for vkb-link lifecycle and rule engine.\n\n### Bug Fixes\n- Fixed issues in vkb-link lifecycle and ui and preferences.\n\n### UI Improvements\n- Improved UI workflows for vkb-link lifecycle and ui and preferences.\n\n### Performance Improvements\n- Improved performance for multiple areas.\n\n### Improvements\n- Refactored vkb-link lifecycle and process reliability for maintainability.\n\n### Improvements\n- Cleaned up configuration for configuration and vkb-link lifecycle.\n\n### Testing\n- Expanded test coverage for vkb-link lifecycle and tests.\n\n### Documentation\n- Updated documentation for developer and release-process documentation.",
  "0.5.0:8af3ae5ef7d1": "### Overview\n\nThis release includes 1 changelog updates across 1 grouped workstreams, focused on Bug Fix.\n\n### Bug Fixes\n- Fixed issues in packaging.",
  "0.4.0:bf825502606e": "### Overview\n\nThis release includes 7 changelog updates across 7 grouped workstreams, focused on Configuration Cleanup, Build / Packaging, Documentation Update.\n\n### Improvements\n- Cleaned up configuration for multiple areas.\n\n### Build and Packaging\n- Improved build and packaging for changelog tooling and release process.\n\n### Documentation\n- Updated documentation for release-process documentation.",
  "0.8.3:a5f426057fa1": "This unreleased update focuses on making release notes accurate and the release process more reliable. It fixes issues that could rewrite or lose summaries and adds automation to reduce manual steps.\n\n### Bug Fixes\n- Release notes keep their intended structure; automation no longer overwrites curated formatting or summaries.\n- Previewing release notes no longer clears saved summaries when a problem is detected; the run stops with a clear message instead.\n- Old draft entries for the upcoming release are cleaned up during previews without touching summaries for past releases.\n- Release creation is blocked when there are uncommitted local changes to avoid publishing from a stale state.\n- Past release v0.8.1 now shows the correct structured summary in the changelog.\n\n### Improvements\n- Releases now start automatically when changes are merged to the main branch, with manual runs still available when needed.\n- Documentation updated to explain the new safety check and how to proceed in exceptional cases."
}
